---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.GetCoordination
source: html/b945c46b-94de-f28c-2392-254a95c7a2b5.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.GetCoordination Method

Gets the coordination of the connector

## Syntax (C#)
```csharp
public Transform GetCoordination()
```

## Returns
The coordination of the connector